Ext.define('Common.Constant', {
  singleton: true,

  /*订单类型*/
  ORDER_TYPE_DATAS: [
    [-1, "全部"], [1, "正常付款"], [2, "货到付款"]
  ],

  /*订单标签*/
  ORDER_TAGS_DATAS: [
    [-1, "全部"], [1, "已合并订单"], [2, "已拆分订单"], [3, "加急订单"],
    [4, "超卖订单"], [5, "手工订单"], [6, "锁定订单"], [7, "拦截订单"],
    [8, "换货订单"], [9, "补发订单"], [10, "售后订单"]
  ],

  /*下单距今*/
  ORDER_TO_NOW_DATAS: [
    [-1, "全部"], ["10", "24小时以内"], ["20", "48小时以内"],
    ["30", "72小时以内"], ["40", "3-7天以内"], ["50", "超过7天"]
  ],

  /*物流公司*/
  EXPRESS_COMPANY_DATAS: [
    [-1, "全部"], [1, "圆通速递"], [2, "EMS"],
    [3, "百世汇通"]
  ],

  /*旗帜类型*/
  FLAG_TYPE_DATAS: [
    ["none", "无旗帜"], ["red", "红旗"], ["yellow", "黄旗"],
    ["green", "绿旗"], ["blue", "蓝旗"], ["purple", "紫旗"]
  ],

  /*证件类型*/
  CERTIFICATE_TYPE_DATAS: [
    [1, "身份证"], [2, "军官证"], [3, "护照"],
    [4, "其他"]
  ],

  /*支付方式*/
  PAYMENT_WAY_DATAS: [
    [1, "支付宝"], [2, "微信"]
  ],

  /*支付结果*/
  PAYMENT_RESULT_DATAS: [
    [1, "已支付"], [2, "未支付"]
  ],

  /*所属订单*/
  ORDER_BELONGS_DATAS: [
    [1, "订单1"], [2, "订单2"], [3, "订单3"], [4, "订单4"], [5, "订单5"]
  ],

});