package com.junyi.erp.enums;

public enum OrderTag {

	/**
	 * 手工订单标签
	 * 手工开单时，自动为手工开单订单加上该标签
	 */
	MANUAL("手", 0x00000001, "#ffae6d"),
	/**
	 * 已合并订单标签
	 * 订单合并时，自动为新生成的合并订单加上该标签
	 */
	COMBINED("合", 0x00000002, "#ffd43d"),
	/**
	 * 已拆分订单标签
	 * 订单拆分时，自动为新生成的拆分订单加上该标签
	 */
	DIVIDED("拆", 0x00000004, "#05cb00"),
	/**
	 * 订单锁定标签
	 * 加锁：“客审锁定”操作时加锁，上锁后，只能由上锁人对订单进行操作（或解锁），其他人不能操作订单；
	 * 解锁：“取消锁定”或“客审通过”时解锁，只有由上锁人解锁
	 */
	LOCKED("锁", 0x00000008, "#f83399"),
	/**
	 * 拦截订单标签
	 * 订单拦截：订单发生异常拦截时（包括“订单拦截”操作及系统自动拦截），自动为拦截订单加上该标签，
	 * 拦截订单不能进行任何操作，取消拦截后方可操作；
	 * 取消拦截：“取消拦截”操作时，自动去除拦截标签
	 */
	HOLDING("拦", 0x00000010, "#f83358"),
	/**
	 * 加急订单标签
	 * 订单加急：“订单加急”操作时，自动为订单加上加急标签；
	 * 取消加急：“取消加急”操作时，自动为订单去除加急标签
	 */
	URGENT("急", 0x00000020, "#f95738"),
	/**
	 * 超卖订单标签
	 * 超卖定义：订单发货仓中商品可用库存不足；
	 * 订单发生超卖时，自动为订单加上超卖标签；反之，则去除超卖标签；
	 * 可能引起更新的操作：调整订单货仓库，商品库存发生变化时（所有库存调整操作）
	 */
	OVERSELL("超", 0x00000040, "#ff0000"),
	/**
	 * 售后订单标签
	 * 当订单发生售后时，需为订单加上售后标签；
	 * 当订单取消售后（即删除售后单）时，需判断若订单不存在有效售后单（即不存在或只存在已删除的售后单），则去除售后标签
	 */
	AFTERSALE("售", 0x00000080, "#9f7fff"),
	/**
	 * 换货订单标签
	 * 订单售后换货时，换发货将以生成新订单方式流转，此时新生成的换发货订单需加上换货标签
	 */
	AFTERSALE_EXCHANGE("换", 0x00000100, "#1ea0fc"),
	/**
	 * 补发货订单标签
	 * 订单补发货时，补发货将以生成新订单方式流转，此时新生成的补发货订单需加上补发货标签
	 */
	AFTERSALE_REISSUE("补", 0x00000200, "#41d5ff"),
	/**
	 * 报关订单标签
	 */
	ORDER_CUSTOMS("关", 0x00000400, "#e17000"),
	/**
	 * 分销订单标签
	 */
	ORDER_DIST("销", 0x00000800, "#bf3f00");

	private String label;
	private int mask;
	private String color;

	OrderTag(String label, int mask, String color) {
		this.label = label;
		this.mask = mask;
		this.color = color;
	}

	public String getLabel() {
		return label;
	}

	public int getMask() {
		return mask;
	}

	public String getColor() {
		return color;
	}
	
}
